#pragma once
#include <cstdint>
#include <string.h>

namespace GZ80
{
#ifndef BYTE_WORD
#define BYTE_WORD
	using Byte = uint8_t;
	using Word = uint16_t;
#endif
	class Memory
	{
	public:
		static constexpr GZ80::Byte bios[] =
		{
			0x31, 0xFE, 0xFF, 0xAF, 0x21, 0xFF, 0x9F, 0x32, 0xCB, 0x7C, 0x20, 0xFB, 0x21, 0x26, 0xFF, 0x0E,
			0x11, 0x3E, 0x80, 0x32, 0xE2, 0x0C, 0x3E, 0xF3, 0xE2, 0x32, 0x3E, 0x77, 0x77, 0x3E, 0xFC, 0xE0,
			0x47, 0x11, 0x04, 0x01, 0x21, 0x10, 0x80, 0x1A, 0xCD, 0x95, 0x00, 0xCD, 0x96, 0x00, 0x13, 0x7B,
			0xFE, 0x34, 0x20, 0xF3, 0x11, 0xD8, 0x00, 0x06, 0x08, 0x1A, 0x13, 0x22, 0x23, 0x05, 0x20, 0xF9,
			0x3E, 0x19, 0xEA, 0x10, 0x99, 0x21, 0x2F, 0x99, 0x0E, 0x0C, 0x3D, 0x28, 0x08, 0x32, 0x0D, 0x20,
			0xF9, 0x2E, 0x0F, 0x18, 0xF3, 0x67, 0x3E, 0x64, 0x57, 0xE0, 0x42, 0x3E, 0x91, 0xE0, 0x40, 0x04,
			0x1E, 0x02, 0x0E, 0x0C, 0xF0, 0x44, 0xFE, 0x90, 0x20, 0xFA, 0x0D, 0x20, 0xF7, 0x1D, 0x20, 0xF2,
			0x0E, 0x13, 0x24, 0x7C, 0x1E, 0x83, 0xFE, 0x62, 0x28, 0x06, 0x1E, 0xC1, 0xFE, 0x64, 0x20, 0x06,
			0x7B, 0xE2, 0x0C, 0x3E, 0x87, 0xF2, 0xF0, 0x42, 0x90, 0xE0, 0x42, 0x15, 0x20, 0xD2, 0x05, 0x20,
			0x4F, 0x16, 0x20, 0x18, 0xCB, 0x4F, 0x06, 0x04, 0xC5, 0xCB, 0x11, 0x17, 0xC1, 0xCB, 0x11, 0x17,
			0x05, 0x20, 0xF5, 0x22, 0x23, 0x22, 0x23, 0xC9, 0xCE, 0xED, 0x66, 0x66, 0xCC, 0x0D, 0x00, 0x0B,
			0x03, 0x73, 0x00, 0x83, 0x00, 0x0C, 0x00, 0x0D, 0x00, 0x08, 0x11, 0x1F, 0x88, 0x89, 0x00, 0x0E,
			0xDC, 0xCC, 0x6E, 0xE6, 0xDD, 0xDD, 0xD9, 0x99, 0xBB, 0xBB, 0x67, 0x63, 0x6E, 0x0E, 0xEC, 0xCC,
			0xDD, 0xDC, 0x99, 0x9F, 0xBB, 0xB9, 0x33, 0x3E, 0x3c, 0x42, 0xB9, 0xA5, 0xB9, 0xA5, 0x42, 0x4C,
			0x21, 0x04, 0x01, 0x11, 0xA8, 0x00, 0x1A, 0x13, 0xBE, 0x20, 0xFE, 0x23, 0x7D, 0xFE, 0x34, 0x20,
			0xF5, 0x06, 0x19, 0x78, 0x86, 0x23, 0x05, 0x20, 0xFB, 0x86, 0x20, 0xFE, 0x3E, 0x01, 0xE0, 0x50
		};
		
		Byte cartridge_rom_0[0x4000];		// 0x0000 - 0x3FFF
		Byte cartridge_rom[128][0x4000];	// 0x4000 - 0x7FFF
		Byte video_ram[2][0x2000];			// 0x8000 - 0x9FFF
		Byte cartridge_ram[4][0x2000];		// 0xA000 - 0xBFFF
		Byte work_ram_0[0x1000];			// 0xC000 - 0xCFFF
		Byte work_ram[7][0x1000];			// 0xD000 - 0xDFFF
		// echo of work ram					// 0xE000 - 0xFDFF
		Byte sprite_attribute_table[0x100];	// 0xFEFF - 0xFE9F
		Byte unusable_area[0x60];			// 0xFEA0 - 0xFEFF
		Byte io[0x80];						// 0xFF00 - 0xFF7F
		Byte high_ram[0x80];				// 0xFF80 - 0xFFFE
		Byte interupt_enable_reg;			// 0xFFFF

		Byte video_ram_select;
		Byte cartridge_ram_bank_select;
		Byte cartridge_rom_bank_select;
		Byte work_ram_select;

	public:
		Memory();
		Byte read_from_address(Word address);
		void write_to_address(Word address, Byte value);
		void set_video_ram_bank(Byte bank_number);
		void set_cartridge_ram_bank(Byte bank_number);
		void set_cartridge_rom_bank(Byte bank_number);
		void set_work_ram_bank(Byte bank_number);
	};
}